In [16]:
import pandas as pd

In [17]:
#reading the csv file
file = "MOCK_DATA1.csv"
df = pd.read_csv(file)

## Data cleaning

In [18]:
#checking which columns has null values
df.isna().sum()
#there are 3 columns with null values
#columns email and username is mandatory, so we need to remove the rows with null values in those 2 columns
#for gender column, we can substitute missing value with 'not disclosed'

id                0
first_name        0
last_name         0
email           113
gender           64
ip_address        0
Username        120
Net               0
Time(Months)      0
Date              0
dtype: int64

In [19]:
#removing rows with null values in username and email columns
df = df.dropna(subset=['Username'])
df = df.dropna(subset=['email'])

In [21]:
df.isna().sum()
#now we have removed all rows from the df that had null values in email and username columns
#now for gender column

id               0
first_name       0
last_name        0
email            0
gender          49
ip_address       0
Username         0
Net              0
Time(Months)     0
Date             0
dtype: int64

In [22]:
df['gender'] = df['gender'].fillna(value='not disclosed')
df.isna().sum()

id              0
first_name      0
last_name       0
email           0
gender          0
ip_address      0
Username        0
Net             0
Time(Months)    0
Date            0
dtype: int64

In [23]:
df[df['gender'] == 'not disclosed']['gender'].count()
#we see that all 38 nulls rows have been replaced

49

## Data Transformation

In [49]:
#so now we have cleaned data with no missing fields
#now we need to perform transformations

In [51]:
#adding new column 'average' for per month earning for each entry
df['average'] = df['Net Worth']/df['Time(Months)']
df['average'] = df['average'].round(2)

##### Filtering

In [45]:
df[df['Net'] == 4270838]
df[df['id'] == 2]

,id,first_name,last_name,email,gender,ip_address,Username,Net,Time(Months),Date,average
1,2,Derward,Chafer,dchafer1@multiply.com,Male,251.121.120.71,dchafer1,4270838,1,10/14/2022,4270838.0

##### Renaming

In [47]:
df.rename(columns={'Net': 'Net Worth'}, inplace=True)
df.head(2)

,id,first_name,last_name,email,gender,ip_address,Username,Net Worth,Time(Months),Date,average
1,2,Derward,Chafer,dchafer1@multiply.com,Male,251.121.120.71,dchafer1,4270838,1,10/14/2022,4270838.0
2,3,Eddie,Halvosen,ehalvosen2@cpanel.net,Female,192.119.102.205,ehalvosen2,3225543,10,2/1/2022,322554.3

##### Dropping columns

In [56]:
#adding test column then dropping it
df['test'] = df['Net Worth'] - 10000
df.head(1)

,id,first_name,last_name,email,gender,ip_address,Username,Net Worth,Time(Months),Date,average,test
1,2,Derward,Chafer,dchafer1@multiply.com,Male,251.121.120.71,dchafer1,4270838,1,10/14/2022,4270838.0,4260838

In [54]:
df.drop(columns=['test'], inplace=True)
df.head(2)

,id,first_name,last_name,email,gender,ip_address,Username,Net Worth,Time(Months),Date,average
1,2,Derward,Chafer,dchafer1@multiply.com,Male,251.121.120.71,dchafer1,4270838,1,10/14/2022,4270838.0
2,3,Eddie,Halvosen,ehalvosen2@cpanel.net,Female,192.119.102.205,ehalvosen2,3225543,10,2/1/2022,322554.3

##### Sorting

In [59]:
df.sort_values(by='Net Worth', ascending=False, inplace=False).head(5)

,id,first_name,last_name,email,gender,ip_address,Username,Net Worth,Time(Months),Date,average,test
872,873,Elvira,Alpine,ealpineo8@earthlink.net,Female,82.132.249.49,ealpineo8,9985375,6,11/1/2022,1664229.17,9975375
518,519,Claudette,Elies,celiesee@ask.com,Female,95.218.26.111,celiesee,9965641,9,4/3/2022,1107293.44,9955641
964,965,Faber,Voak,fvoakqs@purevolume.com,Male,223.141.237.216,fvoakqs,9925163,3,11/11/2022,3308387.67,9915163
566,567,Mickie,Hayes,mhayesfq@google.de,Male,1.173.85.222,mhayesfq,9901272,9,3/22/2022,1100141.33,9891272
637,638,Freeman,Snowdon,fsnowdonhp@yolasite.com,Male,110.225.228.43,fsnowdonhp,9888151,6,4/29/2022,1648025.17,9878151

##### Grouping

In [63]:
grouped_df = df.groupby('gender').count()
grouped_df

,id,first_name,last_name,email,ip_address,Username,Net Worth,Time(Months),Date,average,test
gender,,,,,,,,,,,
Agender,15,15,15,15,15,15,15,15,15,15,15
Bigender,15,15,15,15,15,15,15,15,15,15,15
Female,298,298,298,298,298,298,298,298,298,298,298
Genderfluid,11,11,11,11,11,11,11,11,11,11,11
Genderqueer,12,12,12,12,12,12,12,12,12,12,12
Male,353,353,353,353,353,353,353,353,353,353,353
Non-binary,11,11,11,11,11,11,11,11,11,11,11
Polygender,13,13,13,13,13,13,13,13,13,13,13
not disclosed,49,49,49,49,49,49,49,49,49,49,49

##### Replacing

In [64]:
df['gender'].replace('Female', 'F', inplace=True)
df['gender'].replace('Male', 'M', inplace=True)
df.head(2)

,id,first_name,last_name,email,gender,ip_address,Username,Net Worth,Time(Months),Date,average,test
1,2,Derward,Chafer,dchafer1@multiply.com,M,251.121.120.71,dchafer1,4270838,1,10/14/2022,4270838.0,4260838
2,3,Eddie,Halvosen,ehalvosen2@cpanel.net,F,192.119.102.205,ehalvosen2,3225543,10,2/1/2022,322554.3,3215543

## Exporting to SQL(database)

In [65]:
import sqlite3

In [66]:
#creating database connection
conn = sqlite3.connect('test_database')
#creating a cursor object which is used to perform any and all operations on the DB
c = conn.cursor()

In [75]:
cols = df.columns
c.execute("CREATE TABLE IF NOT EXISTS test_table(cols)")
conn.commit()

In [76]:
df.to_sql('test_table', conn, if_exists='replace', index=False)

777

In [77]:
c.execute("select * from test_table")

In [83]:
data_sql = pd.read_sql("select * from test_table", conn)
data_sql.count()

id              777
first_name      777
last_name       777
email           777
gender          777
ip_address      777
Username        777
Net Worth       777
Time(Months)    777
Date            777
average         777
test            777
dtype: int64